<?php
class App_Utils_Common
{
	public static function capitalize_first($str)
	{
		$line = iconv("UTF-8", "Windows-1251", $str); // convert to windows-1251 
		$line = ucfirst($line); 
		$line = iconv("Windows-1251", "UTF-8", $line); // convert back to utf-8 

		return $line; 
	}

	public static function translit($st)
	{

		$pattern = array(
				"'а'", "'б'", "'в'", "'г'", "'д'", "'е'", "'ё'", "'з'", "'и'", "'й'", "'к'",
				"'л'", "'м'", "'н'", "'о'", "'п'", "'р'", "'с'", "'т'", "'у'", "'ф'", "'х'",
				"'ъ'", "'ы'", "'э'",

				"'А'", "'Б'", "'В'", "'Г'", "'Д'", "'Е'", "'Ё'", "'З'", "'И'", "'Й'", "'К'",
				"'Л'", "'М'", "'Н'", "'О'", "'П'", "'Р'", "'С'", "'Т'", "'У'", "'Ф'", "'Х'", "'Ъ'", "'Ы'", "'Э'",

				"'ж'", "'ц'", "'і'", "'є'", "'ч'", "'ш'", "'щ'", "'ь'", "'ю'", "'я'", "'ї'",
				"'Ж'", "'Ц'", "'Ч'", "'Ш'", "'Щ'", "'Ь'", "'Ю'", "'Я'", "'Ї'",

				"'Š'", "'š'", "'Ð'", "'d'", "'Ž'", "'ž'", "'C'", "'c'", "'C'", "'c'",
				"'À'", "'Á'", "'Â'", "'Ã'", "'Ä'", "'Å'", "'Æ'", "'Ç'", "'È'", "'É'",
				"'Ê'", "'Ë'", "'Ì'", "'Í'", "'Î'", "'Ï'", "'Ñ'", "'Ò'", "'Ó'", "'Ô'",
				"'Õ'", "'Ö'", "'Ø'", "'Ù'", "'Ú'", "'Û'", "'Ü'", "'Ý'", "'Þ'", "'ß'",
				"'à'", "'á'", "'â'", "'ã'", "'ä'", "'å'", "'æ'", "'ç'", "'è'", "'é'",
				"'ê'", "'ë'", "'ì'", "'í'", "'î'", "'ï'", "'ð'", "'ñ'", "'ò'", "'ó'",
				"'ô'", "'õ'", "'ö'", "'ø'", "'ù'", "'ú'", "'û'", "'ý'", "'ý'", "'þ'",
				"'ÿ'", "'R'", "'r'"

			);

		$replace = array(
				"a", "b", "v", "g", "d", "e", "e", "z", "i", "y", "k","l", "m", "n", "o",
				"p", "r", "s", "t", "u", "f", "h", "", "i", "e",

				"A", "B", "V", "G", "D", "E", "E", "Z", "I", "Y", "K", "L", "M", "N", "O",
				"P", "R", "S", "T", "U", "F", "H", "", "I", "E",

				"zh", "ts", "i", "je", "ch", "sh", "shch", "", "yu", "ya", "i",
				"Zh", "Ts", "Ch", "Sh", "Shch", "", "Yu", "Ya", "I",

				"S", "s", "Dj", "d", "Z", "z", "C", "c", "C", "c",
				"A", "A", "A", "A", "A", "A", "A", "C", "E", "E",
				"E", "E", "I", "I", "I", "I", "N", "O", "O", "O",
				"O", "O", "O", "U", "U", "U", "U", "Y", "B", "Ss",
				"a", "a", "a", "a", "a", "a", "a", "c", "e", "e",
				"e", "e", "i", "i", "i", "i", "o", "n", "o", "o",
				"o", "o", "o", "o", "u", "u", "u", "y", "y", "b",
				"y", "R", "r"

			);

		$st = preg_replace($pattern, $replace, $st);

		return $st;
	}

}
?>